app/Services/CurrencyService.php

update `currencies` set `status` = 1, `currencies`.`updated_at` = '2021-07-09 22:33:21' where `id` = 1
---
    public function setDefaultCurrency($currencyCode = 'UAH')
    {
        if ($currencyCode){
            $currency = $this->currencyRepository->getCurrencyByCode($currencyCode);
            $currenciesList = $this->currencyRepository->getCurrenciesList();

            foreach ($currenciesList as $item){
                $item->where('status', 1)->update(['status' => 0]);
            }

            $currency->status = 1;
            $currency->save();