app/Http/Controllers/AuthController.php

    public function login(Request $request)
    {
        if (Auth::check()) {
            return back()->withErrors(['login' => "You already authorize"]);
        }

        $data = $request->except(['_token']);

        if (Auth::attempt($data)) {
            $user = Auth::user();

            session(['user_name' => $user->name]);
            session(['user_role' => $user->roles->first()->role]);
---
select `roles`.*, `role_user`.`user_id` as `pivot_user_id`, `role_user`.`role_id` as `pivot_role_id` from `roles` inner join `role_user` on `roles`.`id` = `role_user`.`role_id` where `role_user`.`user_id` = 6 limit 1