app/Repositories/CategoryRepository.php

    public function getCategoriesList(){
        $columns = ['id', 'category_name' , 'category_slug', 'parent_category'];
        return $this->startCondition()->where('parent_category' , 0)->excerptWithoutCategory()
            ->with('child')->get($columns);
---
select `id`, `category_name`, `category_slug`, `parent_category` from `categories` where `parent_category` = 0